DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
01 NUSUITEP (1:*)
  02 TESTLIB (A8)
  02 TESTCASE (A8)
END-DEFINE

