* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
NUTDCSVP.TEST-DATA-PARSER-PARAM := &1&
NUTDCSVP.TEST-DATA-PARSER := &2&
NUTDCSVP.CURRENT-TEST-DATA-KEY-VALUE := NUTESTP.CURRENT-TEST-DATA-KEY
NUTESTP.MESSAGE := NUTESTP.CURRENT-TEST-DATA-KEY
CALLNAT NUTDCSVP.TEST-DATA-PARSER NUTDCSVP
ASSERT-LINE := *LINE; PERFORM ASSERT-NUM-EQUALS NUASSP 0 NUTDCSVP.P-RC
SEPARATE NUTDCSVP.TEST-DATA INTO &3& WITH DELIMITER &4&

