* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA

PARAMETER USING NUSUITEP

LOCAL

01 #CNT-TESTS (I4) INIT <3>
01 #I-TESTS (I4)

END-DEFINE

EXPAND ARRAY NUSUITEP TO (1:#CNT-TESTS)
NUSUITEP.TESTLIB(1:#CNT-TESTS) := *LIBRARY-ID

ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASNUEQ'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCCRSTAT'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCXMLOUT'

END

