* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA

PARAMETER USING NUSUITEP

LOCAL

01 #CNT-TESTS (I4) INIT <28>
01 #I-TESTS (I4)

END-DEFINE

EXPAND ARRAY NUSUITEP TO (1:#CNT-TESTS)
NUSUITEP.TESTLIB(1:#CNT-TESTS) := *LIBRARY-ID

ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCNUASS'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCNUSEQ'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCNUSRC'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASARAC'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASARAE'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASARAS'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASARNC'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASARNE'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASEERR'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASFAIL'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASFLEQ'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASNUCO'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASNUEQ'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASNUZN'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASSTCO'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASSTEP'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASSTEQ'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASSTSA'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCCRSTAT'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCGETPRO'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCNUCOLL'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TSSUITE2'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCPARAM'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCNUPARS'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASBIEQ'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASF8EQ'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCASSTCA'
ADD 1 TO #I-TESTS; NUSUITEP.TESTCASE(#I-TESTS) := 'TCNURUN'

END

