DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
01 NUPARSEP
  02 LIBNAME (A8)
  02 TESTCASENAME (A8)
  02 VALID (L)
  02 MESSAGE (A) DYNAMIC
  02 TESTS (1:*)
    03 TESTLIB (A8)
    03 TESTCASE (A8)
    03 FIXTURE (A) DYNAMIC
    03 TEST (A) DYNAMIC
    03 TEST-DATA-PARAM (A) DYNAMIC
    03 HAS-SETUP (L)
    03 HAS-TEARDOWN (L)
    03 HAS-SETUP-TESTCASE (L)
    03 HAS-TEARDOWN-TESTCASE (L)
    03 RUN-IN-ORDER (L)
END-DEFINE

