* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
ON ERROR
  IF *ERROR-NR EQ C-NU-ASSERTION-ERROR
    P-RESULT := FALSE
    ESCAPE ROUTINE
  END-IF
END-ERROR

