* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/***********************************************************************

/*  File: TCASSTEQ

/*  NATUNIT's internal TestCase for ASSERT-STRING-EQUALS

/*  Parameters:
/*    NUTESTP - TestCase parameters.

/*  Returns:
/*    NUTESTP - TestCase parameters.

/***********************************************************************
DEFINE DATA

PARAMETER USING NUTESTP

LOCAL USING NUCONST
LOCAL USING NUASSP

LOCAL

01 #STRING1 (A) DYNAMIC
01 #STRING2 (A) DYNAMIC
01 #STRING3 (A8)

01 #ASSERTION-RESULT (L)

END-DEFINE

NUTESTP.FIXTURE := 'assert that two strings are equal'

INCLUDE NUTCTEMP

/***********************************************************************
DEFINE SUBROUTINE SETUP
/***********************************************************************
#STRING1 := 'test'
#STRING2 := 'test2'
END-SUBROUTINE
/***********************************************************************


DEFINE SUBROUTINE TEST

/***********************************************************************
IF NUTESTP.TEST EQ 'string should be equal to itself'
/***********************************************************************
  PERFORM WRAP-ASSERT-STRING-EQUALS #STRING1 #STRING1 #ASSERTION-RESULT
  ASSERT-LINE := *LINE; PERFORM ASSERT-TRUE NUASSP #ASSERTION-RESULT
END-IF

/***********************************************************************
IF NUTESTP.TEST EQ 'different strings should not be equal'
/***********************************************************************
  PERFORM WRAP-ASSERT-STRING-EQUALS #STRING1 #STRING2 #ASSERTION-RESULT
  ASSERT-LINE := *LINE; PERFORM ASSERT-FALSE NUASSP #ASSERTION-RESULT
END-IF

/***********************************************************************
IF NUTESTP.TEST EQ 'equal strings with trailing whitespace should be equal'
/***********************************************************************
  #STRING1 := 'test'
  #STRING2 := 'test '
  PERFORM WRAP-ASSERT-STRING-EQUALS #STRING1 #STRING2 #ASSERTION-RESULT
  ASSERT-LINE := *LINE; PERFORM ASSERT-TRUE NUASSP #ASSERTION-RESULT
END-IF

/***********************************************************************
IF NUTESTP.TEST EQ 'equal strings with leading whitespace should be equal'
/***********************************************************************
  #STRING1 := 'test'
  #STRING2 := ' test'
  PERFORM WRAP-ASSERT-STRING-EQUALS #STRING1 #STRING2 #ASSERTION-RESULT
  ASSERT-LINE := *LINE; PERFORM ASSERT-TRUE NUASSP #ASSERTION-RESULT
END-IF

/***********************************************************************
IF NUTESTP.TEST EQ 'empty strings should be equal'
/***********************************************************************
  RESET #STRING1 #STRING2
  PERFORM WRAP-ASSERT-STRING-EQUALS #STRING1 #STRING2 #ASSERTION-RESULT
  ASSERT-LINE := *LINE; PERFORM ASSERT-TRUE NUASSP #ASSERTION-RESULT
END-IF

/***********************************************************************
IF NUTESTP.TEST EQ 'equal strings of different types should be equal'
/***********************************************************************
  #STRING1 := 'test'
  #STRING3 := 'test'
  PERFORM WRAP-ASSERT-STRING-EQUALS #STRING1 #STRING3 #ASSERTION-RESULT
  ASSERT-LINE := *LINE; PERFORM ASSERT-TRUE NUASSP #ASSERTION-RESULT
END-IF

/***********************************************************************
IF NUTESTP.TEST EQ 'different strings of different types should not be equal'
/***********************************************************************
  #STRING1 := 'test'
  #STRING3 := 'test3'
  PERFORM WRAP-ASSERT-STRING-EQUALS #STRING1 #STRING2 #ASSERTION-RESULT
  ASSERT-LINE := *LINE; PERFORM ASSERT-FALSE NUASSP #ASSERTION-RESULT
END-IF

END-SUBROUTINE

END

